## Mindbox

In [1]:
import pandas as pd

In [69]:
orders = {"Datetime": ['12/12/2012', '12/12/2012', '30/06/1885', '22/02/2002'],
          "CustomerId" : [2,2,3,1],
          "OrderId" : [4,4,6,1]}
orderLines = {"OrderId" : [4,4,6,1],
          "ProductId" : [11,22,33,44],
          "Price" : [100,200,300,400]}

In [70]:
df1 = pd.DataFrame(orders)
df1['Datetime'] = pd.to_datetime(df1['Datetime'])

df2 = pd.DataFrame(orderLines)
df2

   OrderId  ProductId  Price
0        4         11    100
1        4         22    200
2        6         33    300
3        1         44    400

In [75]:
 df3= pd.merge(df1,df2, on='OrderId').drop_duplicates()
df3

    Datetime  CustomerId  OrderId  ProductId  Price
0 2012-12-12           2        4         11    100
1 2012-12-12           2        4         22    200
4 1885-06-30           3        6         33    300
5 2002-02-22           1        1         44    400

In [76]:
df3.describe()

       CustomerId   OrderId  ProductId       Price
count    4.000000  4.000000   4.000000    4.000000
mean     2.000000  3.750000  27.500000  250.000000
std      0.816497  2.061553  14.200939  129.099445
min      1.000000  1.000000  11.000000  100.000000
25%      1.750000  3.250000  19.250000  175.000000
50%      2.000000  4.000000  27.500000  250.000000
75%      2.250000  4.500000  35.750000  325.000000
max      3.000000  6.000000  44.000000  400.000000

In [77]:
freq = df3['OrderId'].value_counts()
freq.idxmax()
df3[]

4